# SpaceSet Class

---
A set that can contain any type of object.
SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.MechanicalSpaceSet
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SpaceSet : APIObject, IEnumerable

    Public Class SpaceSet
    	Inherits APIObject
    	Implements IEnumerable

    public ref class SpaceSet : public APIObject,
    	IEnumerable

    type SpaceSet =
        class
            inherit APIObject
            interface IEnumerable
        end
The SpaceSet type exposes the following members.
| Name| Description
---|---|---
| SpaceSet| Initializes a new instance of the SpaceSet class
Top
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of objects that are in the set.
Top
| Name| Description
---|---|---
| Clear| Removes every item from the set, rendering it empty.
| Contains|
| Dispose| Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| Erase|
| ForwardIterator| Retrieve a forward moving iterator to the set.
| GetEnumerator| Retrieve a forward moving iterator to the set.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Insert|
| ReverseIterator| Retrieve a backward moving iterator to the set.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Mechanical Namespace